WITH ShopSummary AS (
    SELECT
        M.[ID_магазину],
        M.[Адреса],
        M.[Телефон],
        NULL AS [ID_товару],
        NULL AS [Назва],
        NULL AS [Ціна],
        NULL AS [Реалізована кількість],
        NULL AS [Прибуток товару],
        SUM(ZR.[Кількість] * T.[Ціна]) AS [Загальний прибуток]
    FROM
        Магазини M
    LEFT JOIN
        Реалізація R ON M.[ID_магазину] = R.[ID_магазину]
    LEFT JOIN
        Зміст_реалізації ZR ON R.[ID_покупки] = ZR.[ID_покупки]
    LEFT JOIN
        Товар T ON ZR.[ID_товару] = T.[ID_товару]
    GROUP BY
        M.[ID_магазину], M.[Адреса], M.[Телефон]

    UNION ALL

    SELECT
        M.[ID_магазину],
        NULL AS [Адреса],
        NULL AS [Телефон],
        T.[ID_товару],
        T.[Назва],
        T.[Ціна],
        SUM(ZR.[Кількість]) AS [Реалізована кількість],
        SUM(ZR.[Кількість] * T.[Ціна]) AS [Прибуток товару],
        NULL
    FROM
        Магазини M
    LEFT JOIN
        Реалізація R ON M.[ID_магазину] = R.[ID_магазину]
    LEFT JOIN
        Зміст_реалізації ZR ON R.[ID_покупки] = ZR.[ID_покупки]
    LEFT JOIN
        Товар T ON ZR.[ID_товару] = T.[ID_товару]
    GROUP BY
        M.[ID_магазину], T.[ID_товару], T.[Назва], T.[Ціна]
)
SELECT
    [ID_магазину],
    [Адреса],
    [Телефон],
    [ID_товару],
    [Назва],
    [Ціна],
    [Реалізована кількість],
    [Прибуток товару],
    [Загальний прибуток]
FROM
    ShopSummary
ORDER BY
    [ID_магазину] ASC,
    [ID_товару] ASC,
    [Реалізована кількість] DESC;