WITH CategorySummary AS (
    SELECT
        C.[ID_категорії],
        C.[Найменування] AS [Найменування_категорії],
        NULL AS [ID_товару],
        NULL AS [Назва],
        NULL AS [Ціна],
        NULL AS [Реалізована кількість],
        NULL AS [Прибуток товару],
        SUM(ZR.[Кількість] * T.[Ціна]) AS [Загальний прибуток]
    FROM
        Товар_по_категоріям C
    LEFT JOIN
        Товар T ON C.[ID_категорії] = T.[ID_категорії]
    LEFT JOIN
        Зміст_реалізації ZR ON T.[ID_товару] = ZR.[ID_товару]
    WHERE
        ZR.[Кількість] IS NOT NULL 
    GROUP BY
        C.[ID_категорії], C.[Найменування]

    UNION ALL

    SELECT
        C.[ID_категорії],
        NULL AS [Найменування_категорії],
        T.[ID_товару],
        T.[Назва],
        T.[Ціна],
        SUM(ZR.[Кількість]) AS [Реалізована кількість],
        SUM(ZR.[Кількість] * T.[Ціна]) AS [Прибуток товару],
        NULL
    FROM
        Товар_по_категоріям C
    LEFT JOIN
        Товар T ON C.[ID_категорії] = T.[ID_категорії]
    LEFT JOIN
        Зміст_реалізації ZR ON T.[ID_товару] = ZR.[ID_товару]
    WHERE
        ZR.[Кількість] IS NOT NULL 
    GROUP BY
        C.[ID_категорії], T.[ID_товару], T.[Назва], T.[Ціна]
)
SELECT
    [ID_категорії],
    [Найменування_категорії],
    [ID_товару],
    [Назва],
    [Ціна],
    [Реалізована кількість],
    [Прибуток товару],
    [Загальний прибуток]
FROM
    CategorySummary
ORDER BY
    [ID_категорії] ASC,
    [ID_товару] ASC,
    [Реалізована кількість] DESC;